# Виселица
# Классическая игра "Виселица". Компьютер случайным образом выбирает слово
# которое игрок должен огадать буква за буквой. Если игрок не сумеет отгадать за 
# отведенное количество попыток, на экране появится фигурка повешенного. 

# импорт модулей
import random

# константы
HANGMAN = (
"""
-------
|     |
|     |
|
|
|
|
|
|
-------
""",
"""
-------
|     |
|     |
|     O  |
|        
|
|
|
|
-------
""",
"""
-------
|     |
|     |
|     O  |  -+-
|        
|
|
|
|
-------
""",
"""
-------
|     |
|     |
|     O  |  /-+-
|        
|
|
|
|
-------
""",
"""
-------
|     |
|     |
|     O  |  /-+-/
|     |   
|
|
|
|
-------
""",
"""
-------
|     |
|     |
|     O  |  /-+-/
|     |   
|
|
|
|
-------
""",
"""
-------
|     |
|     |
|     O  |  /-+-/
|     |   
|     |
|    |
|    |
|
-------
""",
"""
-------
|     |
|     |
|     O  |  /-+-/
|     |   
|     |
|    | |
|    | |
|
-------
""")

MAX_WRONG = len(HANGMAN) - 1

WORDS = ("СОБАКА", "ДОМ", "АРТИСТ", "ГАЗЕТА", "ЧАСЫ", "АВТОМОБИЛЬ", "КОШКА","ТЕАТР", "КИНО", "ОКНО", "ТРАВА", "РОБОТ", "ФАБРИКА", "КРЫША", "СТЕНА", "ПЛАНЕТА", "РАБОТА", "ОДЕЖДА", "СНЕГ", "АРБУЗ", "АРБАЛЕТ")

# инициализация переменных
word = random.choice(WORDS) # слово для отгадывания

so_far = "-" * len(word)  # по одному дефису на одну букву которую требуется отгадать

wrong = 0 # количество ошибок, которое сделал игрок

used = [] # буквы, котрые игрок уже предлагал

print("Добро пожаловать в игру 'Виселица'. Удачи вам!")
while wrong < MAX_WRONG and so_far != word:
    print(HANGMAN[wrong])
    print("\nВы уже предлагали следующие буквы:\n", used)
    print("\nОтгаданное вами слово сейчас выглядит вот так:\n", so_far)
    guess = input("\n\nВведите букву: ")
    guess = guess.upper()
    while guess in used:
        print("Вы уже предлагали букву", guess)
        guess = input("\n\nВведите букву: ")
        guess = guess.upper()
    used.append(guess)

    if guess in word:
        print("\nДа! Буква", guess, "ectь в слове!")
        # новая строка so_far с отгаданной буквой или буквами
        new = ""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new+= so_far[i]
        so_far = new
    else:
        print("\nК сожалению, буквы", guess, "нет в слове.")
        wrong += 1

if wrong == MAX_WRONG:
    print(HANGMAN[wrong])
    print("\nВас повесили")
else:
    print("\nВы отгадали!")
print("\nБыло загадано слово", word)
input("\n\nНажмите Enter, чтобы выйти")






